Repository: folkien/gtkterm
Catalog: po/*.po
Languages: cs

source: ERROR : Buffer is not initialized !
cs: CHyba : Buffer není inicializován !

source: GTKTerm version %s
cs: Verze GTKTermu: %s

source: https://fedorahosted.org/gtkterm/
cs: https://fedorahosted.org/gtkterm/n

source: This program is released under the terms of the GPL V.2
cs: Tento program je distribuován pod licencí GPL V.2

source: ** Use at your own risks ! **
cs: ** Použití na vlastní nebezpečí ! **

source: Command line options
cs: Nastavení příkazové řádky

source: --help or -h : this help screen
cs: --help nebo -h : zobrazí tuto nápovědu

source: --config <configuration> or -c : load configuration
cs: --config <nastavení> nebo -c : načte nastavení programu uložené vsouboru "nastaveni"

source: --port <device> or -p : serial port device (default /dev/ttyS0)
cs: --port <zařízení> nebo -p : sériový port (výchozí je /dev/ttyS0)

source: --speed <speed> or -s : serial port speed (default 9600)
cs: --speed <rychlost> nebo -s : nastavení přenosové rychlosti (výchozí je9600)

source: --bits <bits> or -b : number of bits (default 8)
cs: --bits <počet_bitů> nebo -b : počet bitů v jednom rámci (výchozí je8 bitů))

source: --stopbits <stopbits> or -t : number of stopbits (default 1)
cs: --stopbits <počet_stop_bitů> nebo -t : počet stopbitů (výchozí je 1)

source: --parity <odd | even> or -a : partity (default none)
cs: --parity <odd | even> nebo -a : zabezpečení paritou: lichá (odd),sudá (even) (výchozí je bez paritního bitu)

source: --flow <Xon | CTS> or -w : flow control (default none)
cs: --flow <Xon | CTS> nebo -w : ovládání toku dat (výchozí je vypnuto)

source: --delay <ms> or -d : end of line delay in ms (default none)
cs: --delay <ms> nebo -d : zpoždění pro znak "konec řádku" (výchozí jevypnuto)

source: --char <char> or -r : wait for a special char at end of line (default none)
cs: --char <char> nebo -r : čeká na speciální znak na konci řádku (výchozí jevypnuto)

source: --file <filename> or -f : default file to send (default none)
cs: --file <nazev_souboru> nebo -f : odešle soubor jako data (výchozí jevypnuto)

source: --echo or -e : switch on local echo
cs: --echo nebo -e : zapne echo na místním terminálu

source: Misunderstood command line option
cs: Nesprávný argument

source: No valid serial device found in /dev, sorry ! You should have at least one of these : /dev/ttyS* /dev/tts/* /dev/ttyUSB* /dev/usb/tts/*
cs: Nenalezeno žádné vhodné zařízení v adresáři /dev, sorry ! Pro správnou funkci by jste měli mít jedno z těchto zařízení : /dev/ttyS* /dev/tts/* /dev/ttyUSB* /dev/usb/tts/*

source: Configuration
cs: Nastavení

source: Serial port
cs: Sériový port

source: Speed :
cs: Rychlost :

source: Parity :
cs: Parita :

source: Bits :
cs: Bity :

source: Stopbits :
cs: Stop bity:

source: Flow control :
cs: Ovládání toku dat :

source: ASCII file transfer
cs: Přenos ASCII souboru

source: End of line delay (milliseconds) :
cs: Zpoždění pro symbol konec řádku (milisekundy) :

source: Wait for this special character before passing to next line :
cs: Před skokem na další řádek čekat na speciální symbol :

source: No open port
cs: Žádný otevřený port

source: Font selection
cs: Výběr písma

source: Load configuration
cs: Načíst nastavení

source: Delete configuration
cs: Smazat nastavení

source: Cannot read configuration file !
cs: Nemohu přečíst konfigurační soubor !

source: Configurations
cs: Nastavení

source: Save configuration
cs: Uložit nastavení

source: Configuration name :
cs: Název tohoto nastavení :

source: Cannot overwrite section !
cs: Nemohu přepsat sekci !

source: Cannot read configuration file !
cs: Nemohu přečíst konfigurační soubor !

source: Configuration [%s] saved
cs: Nastavení [%s] uloženo

source: Warning !
cs: Varování !

source: Section [%s] already exists Do you want to overwrite it ?
cs: Sekce [%s] již existuje Opravdu ji chcete přepsat ?

source: Cannot delete section !
cs: Nemohu smazat sekci !

source: No section "%s" in configuration file
cs: Žádná sekce "%s" v konfiguračním souboru

source: Unknown speed : %d bauds Falling back to default speed : %d bauds
cs: Neznámá rychlost : %d baudů Vracím přenosovou rychlost zpět na : %d baudů

source: Impossible stopbits number : %d Falling back to default stop bits number : %d
cs: Nekorektní počet stop bitů : %d Vracím počet stop bitů na výchozí hodnotu : %d

source: Impossible bits number : %d Falling back to default stop bits : %d
cs: Nekorektní počet bitů : %d Vracím počet bitů na výchozí hodnotu : %d

source: Impossible delay : %d ms Falling back to default delay : %d ms
cs: Příliš velké zpoždění : %d ms Vracím nastavení na výchozí hodnotu : %d ms

source: Configuration file (%s) with [default] configuration has been created.
cs: Byl vytvořen konfigurační soubor %s s výchozím nastavením. Název aktuální konfigurace je [default].

source: Cannot find section %s
cs: Nemohu najít sekci %s

source: File selection
cs: Výběr souboru

source: Error opening file
cs: Chyba při otevírání souboru

source: %s : transfer in progress...
cs: %s : přenáším data...

source: %v / %u bytes (%p %%)
cs: %v / %u bajtů (%p %%)

source: Cancel
cs: Zrušit

source: Cannot read file %s : %s
cs: Nemohu přečíst soubor %s : %s

source: Cannot write file %s
cs: Nemohu uložit soubor %s

source: File error
cs: Něco je špatně se souborem

source: Cannot open file %s : %s
cs: Nemohu otevřít soubor %s : %s

source: Macro "%s" sent !
cs: Makro "%s" odesláno !

source: Shortcut
cs: Zkratka

source: Help on macros
cs: Nápověda k makrům

source: The "action" field of a macro is the data to be sent on the port. Text can be entered, but also special chars, like \n, \t, \r, etc. You can also enter hexadecimal data preceded by a '\'. The hexadecimal data should not begin with a letter (eg. use \0FF and not \FF) Examples : "Hello\n" sends "Hello" followed by a Line Feed "Hello\0A" does the same thing but the LF is entered in hexadecimal
cs: V sloupci "action" jsou data jednotlivých maker, která mají být odeslána.V textu mohou být i speciální znaky jako \n, \t, \r atd. Je možné zadatdata v hexadecimální podobě, ale před touto hodnotou musí být znak '\'.Hexadecimální číslo by nemělo začínat znakem (př.: \0FF je správný zápis,ale \FF je už nesprávný) Příklady : "Ahoj\n" odešle "Ahoj" a přidá znak "nový řádek" (LF - line feed,new line) "Ahoj\0A" odešle prakticky to samé, ale rozdíl je v tom, že speciálníznak je nyní zadán jako hexadecimální číslo

source: Configure Macros
cs: Mastavení maker

source: _Add
cs: _Přidej

source: _Delete
cs: _Smaž

source: _Capture Shortcut
cs: _Zaznamenat zkratku

source: Cannot open configuration file `%s'.
cs: Nemohu otevřít konfigurační soubor `%s'.

source: Cannot create configuration file `%s'.
cs: Nemohu vytvořit konfigurační soubor `%s'.

source: %s(%d): %s Syntax error
cs: %s(%d): %s Chybná syntaxe

source: %s(%d): %s Unrecognized parameter
cs: %s(%d): %s Nemohu rozpoznat parametr

source: %s(%d): %s Internal error
cs: %s(%d): %s Vnitřní chyba

source: %s(%d): %s Invalid number
cs: %s(%d): %s Neplatné číslo

source: %s(%d): %s Out of range
cs: %s(%d): %s Mimo rozsah

source: %s(%d): %s Cannot allocate memory.
cs: %s(%d): %s Nemohu alokovat paměť

source: %s(%d): %s It must be specified TRUE or FALSE.
cs: %s(%d): %s Musí být specifikováno TRUE (1 - pravda) nebo FALSE (0 - lež).

source: %s(%d): %s The section name is already used.
cs: %s(%d): %s Takové jméno pro sekci už existuje

source: %s(%d) There is no closing brace.
cs: %s(%d) Chybí ukončovací závorky.

source: %s(%d): %s Unexplained error
cs: %s(%d): %s Neznámá chyba

source: Cannot open %s : %s
cs: Nemohu otevřít%s : %s

source: Control signals read
cs: Řídicí signály byly přečteny

source: DTR write
cs: Zápis DTR

source: RTS write
cs: Zápis RTS

source: Lockfile is stale. Overriding it..
cs: Vypadá to, že sériový port byl používán, ale už není. Obcházím to...

source: Device %s is locked.
cs: Zařízení %s je používáno.

source: Cannot create lockfile. Sorry.
cs: Nemohu vytvořit zamykací soubor (lockfile). Sorry

source: /_File
cs: _Soubor

source: /File/Clear screen
cs: /Soubor/Smazat obrazovku

source: /File/Send _raw file
cs: /Soubor/_Odeslat binární soubor

source: /File/_Save raw file
cs: /Soubor/_Uložit binární soubor

source: /File/Separator
cs: /SOubor/Oddělovač

source: /File/E_xit
cs: /SOubor/_Ukončit

source: /_Configuration
cs: /_Nastavení

source: /Configuration/_Port
cs: /Nastavení/_Port

source: /Configuration/Local _echo
cs: /Nastavení/_Lokální echo

source: /Configuration/_Macros
cs: /Nastavení/_Makra

source: /Configuration/Separator
cs: /Nastavení/Oddělovač

source: /Configuration/_Load configuration
cs: /Nastavení/_Načíst nastavení

source: /Configuration/_Save configuration
cs: /Configuration/_Uložit nastavení

source: /Configuration/_Delete configuration
cs: /Configuration/_Smazat nastavení

source: /Control _signals
cs: /Řídící _signály

source: /Control signals/Send break
cs: /Řídící signály/Poslat break

source: /Control signals/Toggle DTR
cs: /Řídící signály/Změnit DTR

source: /Control signals/Toggle RTS
cs: /Řídící signály/Změnit RTS

source: /_View
cs: /_Pohled

source: /View/_ASCII
cs: /Pohled/_ASCII

source: /View/_Hexadecimal
cs: /Pohled/_Hexadecimální

source: /View/Hexadecimal _chars
cs: /Pohled/Hexadecimální _znaky

source: /View/Hexadecimal chars/_8
cs: /Pohled/Hexadecimální znaky/_8

source: /View/Hexadecimal chars/1_0
cs: /Pohled/Hexadecimální znaky/1_0

source: /View/Hexadecimal chars/_16
cs: /Pohled/Hexadecimální znaky/_16

source: /View/Hexadecimal chars/_24
cs: /Pohled/Hexadecimální znaky/_24

source: /View/Hexadecimal chars/_32
cs: /Pohled/Hexadecimální znaky/_32

source: /View/Show _index
cs: /Pohled/Zobraz _index

source: /View/Separator
cs: /Pohled/Oddělovač

source: /View/_Send hexadecimal data
cs: /Pohled/_Odešli hexadecimální data

source: /_Help
cs: _Nápověda

source: /Help/_About...
cs: /Nápověda/_O programu...

source: Hexadecimal data to send (separator : ';' or space) :
cs: Hexadecimální data k odeslání (oddělovač : ';' nebo mezera) :

source: About...
cs: O programu...

source: Break signal sent !
cs: Signál break odeslán !

source: "%s" : %d byte(s) sent !
cs: "%s" : %d bajtů(s) odesláno(s) !
